{"text": "The mitochondria is the powerhouse of the cell. It produces ATP through cellular respiration, converting glucose and oxygen into energy that cells can use for various functions. This organelle has its own DNA, separate from the cell's nuclear DNA, which supports the endosymbiotic theory suggesting mitochondria were once free-living bacteria."}
{"text": "Machine learning algorithms can be broadly categorized into supervised learning, unsupervised learning, and reinforcement learning. Supervised learning uses labeled data to train models for classification or regression tasks. Unsupervised learning discovers hidden patterns in unlabeled data through clustering or dimensionality reduction. Reinforcement learning trains agents to make decisions by maximizing cumulative rewards."}
{"text": "The French Revolution, which began in 1789, was a period of radical political and societal change in France. It marked the decline of powerful monarchies and churches and the rise of democracy and nationalism. The revolution began with the Estates General of 1789 and ended in the late 1790s with the ascent of Napoleon Bonaparte."}
{"text": "Quantum entanglement is a phenomenon where two or more particles become interconnected in such a way that the quantum state of each particle cannot be described independently of the others, even when separated by large distances. This 'spooky action at a distance,' as Einstein called it, forms the basis for quantum computing and quantum cryptography."}
{"text": "The human genome contains approximately 3 billion base pairs of DNA and around 20,000-25,000 protein-coding genes. The Human Genome Project, completed in 2003, was an international scientific research project with the goal of determining the sequence of nucleotide base pairs that make up human DNA and identifying all genes in the human genome."}
{"text": "Climate change refers to long-term shifts in global temperatures and weather patterns. While natural cycles have caused climate changes in the past, human activities have been the main driver since the 1800s, primarily due to burning fossil fuels like coal, oil, and gas. The resulting greenhouse gas emissions trap heat in the atmosphere, leading to global warming."}
{"text": "The stock market operates through exchanges where buyers and sellers trade shares of publicly listed companies. Stock prices are determined by supply and demand dynamics, influenced by factors including company performance, economic conditions, investor sentiment, and market speculation. Major indices like the S&P 500 and Dow Jones track overall market performance."}
{"text": "Neural networks are computing systems inspired by biological neural networks in the brain. They consist of interconnected nodes (neurons) organized in layers. Input data passes through these layers, with each connection having an associated weight that adjusts during training. Deep neural networks with many hidden layers can learn complex patterns in data."}
{"text": "The Renaissance was a cultural movement that began in Italy in the 14th century and spread across Europe until the 17th century. It marked a period of renewed interest in classical Greek and Roman culture, leading to significant developments in art, architecture, politics, science, and literature. Key figures include Leonardo da Vinci, Michelangelo, and Galileo Galilei."}
{"text": "Photosynthesis is the process by which plants convert light energy, usually from the sun, into chemical energy stored in glucose. This occurs primarily in the chloroplasts of plant cells, where chlorophyll absorbs light. The process takes in carbon dioxide and water, producing glucose and releasing oxygen as a byproduct, forming the foundation of most food chains on Earth."}
